/**
 * Error Code Service
 */
define([], function () {

    var codeMap = {
        "-999":"请求数据解析异常",
        "9999":"未知异常",
        "9996":"签名密钥错误",
        "9997":"数据库异常",
        "9998":"系统异常",
        "1":"参数为空",
        "2":"参数为非数字",
        "3":"无购彩记录",
        "-1":"手机序列号过长,使得写入数据库失败",
        "-2":"Sim 卡号过长,使得写入数据库失败",
        "-3":"手机型号过长,使得写入数据库失败",
        "-4":"手机物理地址过长,使得写入数据库失败",
        "-5":"手机型号过长,使得写入数据库失败",
        "-6":"插入数据库内容超长,造成写数据库失败",
        "-7":"Imei 在数据库已经有了相同的号码,不统计重复",
        "-8":"simCd 在数据库已经有了相同的号码,不统计重复",
        "-9":"mobileNo 在数据库已经有了相同的号码,不统计重复",
        "-10":"mac 在数据库已经有了相同的号码,不统计重复",
        "-11":"渠道号过长,使得写入数据库失败",
        "-15":"用户帐号被锁定",
        "-21":"用户名有非法字符,客户端要提示只能是中文英文数字,英文不区分大小写.",
        "-25":"用户登录超时",
        "-32":"手机号为空",
        "-33":"手机号有误",
        "-46":"银行卡开户名与身份证上姓名不一致",
        "-49":"身份证号码异常",
        "-50":"名字包含非法字符",
        "-51":"没有此用户的身份证信息",
        "-52":"非法提款金额",
        "-53":"提款密码错误",
        "-54":"提款金额大于帐户余额",
        "-55":"未绑定银行卡或银行卡信息有误",
        "-56":"提款金额不符合提款要求",
        "-57":"小于10 元时不可提款",
        "-58":"大于可提款金额",
        "-59":"验证码错误",
        "-60":"一个用户只能发三次",
        "-61":"验证码失效",
        "-64":"反馈内容为空",
        "-65":"反馈内容长度超过200 个字符",
        "-66":"联系方式超过50 个字符",
        "-67":"方案不存在",
        "-68":"已经撤单",
        "-69":"余额不足",
        "-70":"已经满员",
        "-71":"投注期号已经截止",
        "-73":"评论内容带敏感字符",
        "-74":"当前评论id 为（null 或“”）",
        "-75":"渠道（null 或“”）"
    };

    /**
     * 获取错误代码含义
     * @param code
     */
    var getErrorTitle = function (code) {
        return codeMap[code];
    };

    return {
        getErrorTitle:getErrorTitle
    };
});