/**
 * 竞彩足球串法.
 */
define([], function () {


    var lottery46Spellings = {
        /**
         * 单关串法,
         * 胜平负 最少2串1，最多8串1
         * 总进球 最少2串1，最多6串1
         * 比分   最少2串1，最多4串1
         * 半全场 最少2串1，最多4串1
         */
        bet_lottery46_common: {
            "2-1": "2串1",
            "3-1": "3串1",
            "4-1": "4串1",
            "5-1": "5串1",
            "6-1": "6串1",
            "7-1": "7串1",
            "8-1": "8串1"
        },
        bet_lottery46_multi_3: {
            "3-3": "3串3",
            "3-4": "3串4"
        },
        bet_lottery46_multi_4: {
            "4-4": "4串4",
            "4-5": "4串5",
            "4-6": "4串6",
            "4-11": "4串11"
        },
        bet_lottery46_multi_5: {
            "5-5": "5串5",
            " 5-6": "5串6",
            "5-10": "5串10",
            "5-16": "5串16",
            "5-20": "5串20",
            "5-26": "5串26"
        },
        bet_lottery46_multi_6: {
            "6-6": "6串6",
            "6-7": "6串7",
            "6-15": "6串15",
            "6-20": "6串20",
            "6-22": "6串22",
            "6-35": "6串35",
            "6-42": "6串42",
            "6-50": "6串50",
            "6-57": "6串57"
        },
        bet_lottery46_multi_7: {
            "7-7": "7串7",
            "7-8": "7串8",
            "7-21": "7串21",
            "7-35": "7串35",
            "7-120": "7串120"
        },
        bet_lottery46_multi_8: {
            "8-8": "8串8",
            "8-9": "8串9",
            "8-28": "8串28",
            "8-56": "8串56",
            "8-70": "8串70",
            "8-247": "8串247"
        }
    };

    /** 竞彩足球投注规则,
     * 胜平负：胜（3），平（1），负（0）
     比分：1:0(1-0)
     总进球：1到6球（1，2，3，4，5，6），7+（7）
     半全场：胜（s）,平（p）,负(f),胜-胜（s-s）
     让球胜平负：胜（3），平（1），负（0）
     */

    /**
     * 根据玩法,得到相应的串法.
     */
    return {
        lottery46Spellings: lottery46Spellings
    }
})
;
